[
  {
    "keyword": "baggage lost",
    "summary": "Passengers are entitled to up to 1,288 SDR for baggage that is declared lost (not returned after 21 days).",
    "article": "GACA Article 1 – Baggage Loss Compensation"
  },
  {
    "keyword": "baggage delayed",
    "summary": "Passengers are entitled to 148 SDR for the first day of delayed baggage, and 60 SDR per day thereafter up to 1,288 SDR.",
    "article": "GACA Article 2 – Baggage Delay Compensation"
  },
  {
    "keyword": "baggage damaged",
    "summary": "Passengers are entitled to compensation up to 1,288 SDR for physical damage to checked baggage.",
    "article": "GACA Article 3 – Damaged Baggage Compensation"
  },
  {
    "keyword": "flight delay",
    "summary": "Passengers are entitled to 50 SDR for delays exceeding 3 hours and 150 SDR for delays exceeding 6 hours, in addition to care and support (meals, transport, accommodation).",
    "article": "GACA Article 4 – Flight Delay Compensation"
  },
  {
    "keyword": "flight cancellation",
    "summary": "Passengers are entitled to a full refund or alternate flight plus 50% to 150% compensation based on notice period.",
    "article": "GACA Article 5 – Flight Cancellation Compensation"
  },
  {
    "keyword": "denied boarding",
    "summary": "If a passenger is denied boarding due to overbooking, they are entitled to full refund or alternate flight and compensation.",
    "article": "GACA Article 6 – Denied Boarding Compensation"
  },
  {
    "keyword": "meal compensation",
    "summary": "Passengers delayed for more than 2 hours are entitled to meals and refreshments at the airline’s expense.",
    "article": "GACA Article 7 – Meal Support During Delay"
  },
  {
    "keyword": "hotel compensation",
    "summary": "If delay or cancellation requires an overnight stay, passengers are entitled to hotel accommodation and transport to/from airport.",
    "article": "GACA Article 8 – Hotel Accommodation for Extended Delays"
  },
  {
    "keyword": "ticket refund",
    "summary": "Passengers can request a full refund in cases of cancellation, over 5h delay, or missed connection caused by airline.",
    "article": "GACA Article 9 – Ticket Refund Policy"
  },
  {
    "keyword": "special assistance",
    "summary": "Passengers with reduced mobility or medical conditions are entitled to priority boarding, assistance, and accessible services.",
    "article": "GACA Article 10 – Rights to Special Assistance"
  },
  {
    "keyword": "no show",
    "summary": "If a passenger is marked as 'no show' due to airline operational errors or lack of communication, full refund and rebooking must be offered.",
    "article": "GACA Article 11 – No Show Due to Airline Error"
  },
  {
    "keyword": "care and support",
    "summary": "Airlines must provide water, meals, communication access, and accommodation when passengers face long delays or disruptions.",
    "article": "GACA Article 12 – Care and Support Obligations"
  }
]